using System;
using System.Threading;
// Клас с главен метод:
class BackgroundDemo{
   // Статичен метод за изпълнение във фонова нишка:
   static void run(){
      // Показване на съобщение:
      Console.WriteLine("Дъщерната нишка е стартирана...");
      // Целочислена променлива:
      int k=1;
      // Безкраен цикъл:
      while(true){
         // Показване на съобщение:
         Console.WriteLine("Дъщерна нишка: "+k);
         // Увеличаване стойността на променливата:
         k++;
         // Задържане изпълнението на нишката:
         Thread.Sleep(2100);
      }
   }
   // Главен метод:
   static void Main(){
      // Показване на начално съобщение:
      Console.WriteLine("Главната нишка е стартирана...");
      // Създаване на обект на нишка:
      Thread t=new Thread(run);
      // Фонова нишка:
      t.IsBackground=true;
      // Стартиране на фоновата нишка:
      t.Start();
      // Оператор за цикъл:
      for(char s='A';s<='F';s++){
         // Показване на съобщение:
         Console.WriteLine("Главна нишка:  "+s);
         // Задържане изпълнението на главната нишка:
         Thread.Sleep(1000);
      }
      // Показване на последно съобщение:
      Console.WriteLine("Главната нишка приключи...");
   }
}
